; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v5 ?v6)
             (pred_2 ?v13 ?v4)
             (pred_8 ?v5 ?v4)
             (pred_6 ?v3 ?v5 )
	     (pred_5 ?v5)
             (pred_10 ?v7)
             (pred_4 ?v13)
             (pred_11 ?v4)
             (pred_12 ?v5)
             (pred_7 ?v13)
             (pred_3 ?v5)
             (pred_9 ))



(:action op_3
:parameters (?v10 ?v9 ?v12 ?v1)
:precondition (and (pred_10 ?v10) (pred_10 ?v9) (pred_4 ?v12) (pred_11 ?v1)
          (pred_1 ?v10 ?v9) (pred_2 ?v12 ?v1)
                   (pred_8 ?v9 ?v1) (pred_5 ?v10) 
                   (pred_12 ?v9) (pred_7 ?v12))
:effect (and  (pred_3 ?v9) (not (pred_12 ?v9))))


(:action op_5
:parameters (?v10 ?v11)
:precondition (and (pred_10 ?v10) (pred_10 ?v11)
               (pred_5 ?v10) (pred_1 ?v10 ?v11) (pred_3 ?v11))
:effect (and (pred_5 ?v11) (not (pred_5 ?v10))))

(:action op_2
:parameters (?v10 ?v12)
:precondition (and (pred_10 ?v10) (pred_4 ?v12) 
                  (pred_5 ?v10) (pred_6 ?v12 ?v10) (pred_9 ))
:effect (and (pred_7 ?v12)
   (not (pred_6 ?v12 ?v10)) (not (pred_9 ))))


(:action op_1
:parameters (?v10 ?v2 ?v8)
:precondition (and (pred_10 ?v10) (pred_4 ?v2) (pred_4 ?v8)
                  (pred_5 ?v10) (pred_7 ?v8) (pred_6 ?v2 ?v10))
:effect (and (pred_7 ?v2) (pred_6 ?v8 ?v10)
        (not (pred_7 ?v8)) (not (pred_6 ?v2 ?v10))))

(:action op_4
:parameters (?v10 ?v12)
:precondition (and (pred_10 ?v10) (pred_4 ?v12) 
                  (pred_5 ?v10) (pred_7 ?v12))
:effect (and (pred_9 ) (pred_6 ?v12 ?v10) (not (pred_7 ?v12)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_09 obj_07 obj_21 obj_02 obj_11 obj_12 obj_15 obj_08 obj_18 obj_01 obj_13 obj_19 obj_16 obj_06 obj_22 obj_04
    obj_10 obj_05 obj_03
    obj_20 obj_17 obj_14
    )

    (:init
       (pred_9)

       (pred_10 obj_09)
       (pred_10 obj_07)
       (pred_10 obj_21)
       (pred_10 obj_02)
       (pred_10 obj_11)
       (pred_10 obj_12)
       (pred_10 obj_15)
       (pred_10 obj_08)
       (pred_10 obj_18)
       (pred_10 obj_01)
       (pred_10 obj_13)
       (pred_10 obj_19)
       (pred_10 obj_16)
       (pred_10 obj_06)
       (pred_10 obj_22)
       (pred_10 obj_04)
       (pred_11 obj_10)
       (pred_11 obj_05)
       (pred_11 obj_03)
       (pred_4 obj_20)
       (pred_4 obj_17)
       (pred_4 obj_14)

       (pred_1 obj_09 obj_11)
       (pred_1 obj_09 obj_07)
       (pred_1 obj_07 obj_12)
       (pred_1 obj_07 obj_21)
       (pred_1 obj_07 obj_09)
       (pred_1 obj_21 obj_15)
       (pred_1 obj_21 obj_02)
       (pred_1 obj_21 obj_07)
       (pred_1 obj_02 obj_08)
       (pred_1 obj_02 obj_21)
       (pred_1 obj_11 obj_18)
       (pred_1 obj_11 obj_12)
       (pred_1 obj_11 obj_09)
       (pred_1 obj_12 obj_01)
       (pred_1 obj_12 obj_15)
       (pred_1 obj_12 obj_07)
       (pred_1 obj_12 obj_11)
       (pred_1 obj_15 obj_13)
       (pred_1 obj_15 obj_08)
       (pred_1 obj_15 obj_21)
       (pred_1 obj_15 obj_12)
       (pred_1 obj_08 obj_19)
       (pred_1 obj_08 obj_02)
       (pred_1 obj_08 obj_15)
       (pred_1 obj_18 obj_16)
       (pred_1 obj_18 obj_01)
       (pred_1 obj_18 obj_11)
       (pred_1 obj_01 obj_06)
       (pred_1 obj_01 obj_13)
       (pred_1 obj_01 obj_12)
       (pred_1 obj_01 obj_18)
       (pred_1 obj_13 obj_22)
       (pred_1 obj_13 obj_19)
       (pred_1 obj_13 obj_15)
       (pred_1 obj_13 obj_01)
       (pred_1 obj_19 obj_04)
       (pred_1 obj_19 obj_08)
       (pred_1 obj_19 obj_13)
       (pred_1 obj_16 obj_06)
       (pred_1 obj_16 obj_18)
       (pred_1 obj_06 obj_22)
       (pred_1 obj_06 obj_01)
       (pred_1 obj_06 obj_16)
       (pred_1 obj_22 obj_04)
       (pred_1 obj_22 obj_13)
       (pred_1 obj_22 obj_06)
       (pred_1 obj_04 obj_19)
       (pred_1 obj_04 obj_22)
       (pred_12 obj_22)
       (pred_12 obj_16)
       (pred_12 obj_15)
       (pred_8  obj_22 obj_10)
       (pred_8  obj_16 obj_05)
       (pred_8  obj_15 obj_03)
       (pred_3 obj_09)
       (pred_3 obj_07)
       (pred_3 obj_21)
       (pred_3 obj_02)
       (pred_3 obj_11)
       (pred_3 obj_12)
       (pred_3 obj_08)
       (pred_3 obj_18)
       (pred_3 obj_01)
       (pred_3 obj_13)
       (pred_3 obj_19)
       (pred_3 obj_06)
       (pred_3 obj_04)

       (pred_2  obj_20 obj_10)
       (pred_2  obj_17 obj_05)
       (pred_2  obj_14 obj_03)
       (pred_6 obj_20 obj_11)
       (pred_6 obj_17 obj_09)
       (pred_6 obj_14 obj_19)
       (pred_5 obj_12)
    )

    (:goal (and
       (pred_6 obj_20 obj_02)
       (pred_6 obj_14 obj_06)
    ))
(:constraints
  (always (not (pred_5 obj_13)))
)
)

; plan
1. (op_5 obj_12 obj_11)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_11)
   goals met: 0 of 2
2. (op_2 obj_11 obj_20)
   deleted: (pred_6 obj_20 obj_11) (pred_9)
   added: (pred_7 obj_20)
   goals met: 0 of 2
3. (op_5 obj_11 obj_12)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_12)
   goals met: 0 of 2
4. (op_5 obj_12 obj_01)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_01)
   goals met: 0 of 2
5. (op_5 obj_01 obj_06)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_06)
   goals met: 0 of 2
6. (op_3 obj_06 obj_22 obj_20 obj_10)
   deleted: (pred_12 obj_22)
   added: (pred_3 obj_22)
   goals met: 0 of 2
7. (op_5 obj_06 obj_22)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_22)
   goals met: 0 of 2
8. (op_5 obj_22 obj_04)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_04)
   goals met: 0 of 2
9. (op_5 obj_04 obj_19)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_19)
   goals met: 0 of 2
10. (op_5 obj_19 obj_08)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_08)
   goals met: 0 of 2
11. (op_5 obj_08 obj_02)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_02)
   goals met: 0 of 2
12. (op_4 obj_02 obj_20)
   deleted: (pred_7 obj_20)
   added: (pred_9) (pred_6 obj_20 obj_02)
   goals met: 1 of 2
13. (op_5 obj_02 obj_08)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_08)
   goals met: 1 of 2
14. (op_5 obj_08 obj_19)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_19)
   goals met: 1 of 2
15. (op_2 obj_19 obj_14)
   deleted: (pred_6 obj_14 obj_19) (pred_9)
   added: (pred_7 obj_14)
   goals met: 1 of 2
16. (op_5 obj_19 obj_04)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_04)
   goals met: 1 of 2
17. (op_5 obj_04 obj_22)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_22)
   goals met: 1 of 2
18. (op_5 obj_22 obj_06)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_06)
   goals met: 1 of 2
19. (op_4 obj_06 obj_14)
   deleted: (pred_7 obj_14)
   added: (pred_9) (pred_6 obj_14 obj_06)
   goals met: 2 of 2
